In [10]:
#!pip install kaggle

In [7]:
import kaggle

In [9]:
# download dataset using kaggle 

!kaggle datasets download thedevastator/analyzing-credit-card-spending-habits-in-india -f "Credit card transactions - India - Simple.csv"

Dataset URL: https://www.kaggle.com/datasets/thedevastator/analyzing-credit-card-spending-habits-in-india
License(s): other
Downloading Credit%20card%20transactions%20-%20India%20-%20Simple.csv.zip to C:\Users\kmamamt\Desktop\Python\Ankit_Bansal\ETL_Project

  0%|          | 0.00/319k [00:00<?, ?B/s]
100%|##########| 319k/319k [00:01<00:00, 222kB/s]
100%|##########| 319k/319k [00:01<00:00, 222kB/s]

In [2]:
# extract file from zip file

import zipfile
zip_ref = zipfile.ZipFile('Credit card transactions - India - Simple.zip')
zip_ref.extractall() # extract file
zip_ref.close() # close file

In [3]:
#read data from file and handle null values
import pandas as pd

df = pd.read_csv('Credit card transactions - India - Simple.csv')
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [4]:
# to check distinct values

df['Card Type'].unique()

array(['Gold', 'Platinum', 'Silver', 'Signature'], dtype=object)

In [12]:
# changing the column names to lowercase

df.columns = df.columns.str.lower()
df.columns

Index(['index', 'city', 'date', 'card type', 'exp type', 'gender', 'amount'], dtype='object')

In [13]:
#replace the space in column with underscore

df.columns = df_columns.str.replace(' ','_')
df.columns

Index(['index', 'city', 'date', 'card_type', 'exp_type', 'gender', 'amount'], dtype='object')

In [14]:
df.head()

   index                   city       date  card_type exp_type gender  amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [15]:
df.dtypes

index         int64
city         object
date         object
card_type    object
exp_type     object
gender       object
amount        int64
dtype: object

In [18]:
#load data in sql(pgadmin) and doing analysis

# load the data in sql (pgadmin for postgreSQL)
import pandas as pd
import sqlalchemy as sal

engine = sal.create_engine('postgresql://postgres:password@localhost:5432/python_db')
conn=engine.connect()

In [22]:
df.to_sql('df_credit_card_transactions', con = conn, index = False, if_exists = 'append')

52

In [ ]:
# SQL Queries for analysis

1- write a query to print top 5 cities with highest spends and their percentage contribution of total credit card spends 



with total_expense_cte as
(
    select sum(amount) as total_expense
    from df_credit_card_transactions
)

select city,sum(amount) as spends,
ROUND((100.0*sum(amount)/cte.total_expense ),2) as perc_expense
from df_credit_card_transactions
cross join total_expense_cte as cte
group by city,total_expense
order by spends desc
limit 5

In [ ]:
2- write a query to print highest spend month and amount spent in that month for each card type

with cte as (
select card_type,
date_part('month',date) as month,
date_part('year',date) as year,
sum(amount) as amount_spent
from df_credit_card_transactions
group by 1,2,3
)
select card_type,month,year,
amount_spent
from (
select *,
rank() over(partition by card_type order by amount_spent desc)as rn
from cte
)a
where rn = 1

In [ ]:
3- write a query to print the transaction details(all columns from the table) for each card type when
it reaches a cumulative of 1000000 total spends(We should have 4 rows in the o/p one for each card type)



with cte as (
select *,
sum(amount) over(partition by card_type order by date,index) as total_spend
from df_credit_card_transactions
order by card_type
)
select *
from 
(
select *,
rank() over(partition by card_type order by total_spend ) as rn
from (
select *
from cte
where total_spend >= 1000000
)a

)b
where rn = 1

In [ ]:
4- write a query to find city which had lowest percentage spend for gold card type

with gold_expense as (
select city,
card_type,
sum(amount) as gold_expense
from df_credit_card_transactions
where lower(card_type) = 'gold'
group by 1,2
),
total_expense_cte as 
(
select city,sum(amount) as total_expense
from df_credit_card_transactions
group by city
)
select g.city,
(1.0*g.gold_expense/t.total_expense) as gold_contribution,
t.total_expense as total_expense,
g.gold_expense as gold_expense
from gold_expense g
inner join total_expense_cte t
on g.city = t.city
order by gold_contribution
limit 1

In [ ]:
5- write a query to print 3 columns:  city, highest_expense_type , lowest_expense_type (example format : Delhi , bills, Fuel)
    
with expense_cte as (
select city,exp_type,
sum(amount)as total_expense
from df_credit_card_transactions
group by city,exp_type
),
ranking as(
select *,
rank() over(partition by city order by total_expense desc) as highest_ranking,
rank() over(partition by city order by total_expense) as lowest_ranking
from expense_cte
)

select city,
min(case when highest_ranking = 1 then exp_type end) as highest_expense_type,
min(case when lowest_ranking = 1 then exp_type end) as lowest_expense_type
from ranking
group by city